# Examples for reading from a database
## Copyright (C) Princeton Consultants, 2017-2018
## Assumes a MySQL database set up, with schema `pandas`, table `gas`, user `irv`, and password
### First, import the pandas library

In [1]:
import pandas as pd

### Use `sqlalchemy` to make the connection to the database.  This has to be modified based on the specific database being used, as well as username and password

In [2]:
import sqlalchemy as sqla
engine = sqla.create_engine('mysql+pymysql://irv:Testing123@localhost:3306') # Defines connection to database

conn=engine.connect()   # Connects to the DB
print("have conn")

have conn

### Read in the table `gas` from the schema `pandas`

In [3]:
df1=pd.read_sql_table("gas", con=conn, schema="pandas")
df1

      name  demand  price  octane  lead
0   Diesel  1000.0   50.0     6.0   1.0
1  Regular  2000.0   60.0     8.0   2.0
2    Super  3000.0   70.0    10.0   1.0

### Note that the table has a default index.  Use our knowledge that `"name"` is the primary key to make it the index

In [4]:
df2=pd.read_sql_table("gas", con=conn, schema="pandas", index_col="name")
df2

         demand  price  octane  lead
name
Diesel   1000.0   50.0     6.0   1.0
Regular  2000.0   60.0     8.0   2.0
Super    3000.0   70.0    10.0   1.0

### Using `sqlalchemy`, you can determine the primary keys, so you can get a table where you know the index is unique

In [5]:
pkeys = sqla.Table('gas', sqla.MetaData(), autoload=True,
                   autoload_with=engine, schema='pandas').primary_key.columns.keys() # Get the primary keys
df3=pd.read_sql_table("gas", con=conn, schema="pandas", index_col=pkeys)
df3

         demand  price  octane  lead
name
Diesel   1000.0   50.0     6.0   1.0
Regular  2000.0   60.0     8.0   2.0
Super    3000.0   70.0    10.0   1.0

### You can also use a direct SQL query

In [6]:
df4 = pd.read_sql("SELECT name, demand, price from pandas.gas", conn, index_col="name")
df4

         demand  price
name
Diesel   1000.0   50.0
Regular  2000.0   60.0
Super    3000.0   70.0

### Close the database connection

In [7]:
conn.close()